Repository: OAB710/Recipe-Flutter-Application
Catalog: recipr/lib/l10n/app_*.arb
Languages: vi

# recipes_title
source: Recipes
vi: Công thức nấu ăn

# mandu_title
source: Dumplings
vi: Há cảo

# spaghetti_title
source: Spaghetti
vi: Mì Ý

# pizza_title
source: Pizza
vi: Bánh pizza

# search_hint
source: Search...
vi: Tìm kiếm...

# nutrition_label
source: Nutrition
vi: Dinh dưỡng

# ingredients_label
source: Ingredients
vi: Nguyên liệu

# steps_label
source: Steps
vi: Các bước

# calories_label
source: Calories
vi: Calo

# protein_label
source: Protein
vi: Chất đạm

# carb_label
source: Carbs
vi: Tinh bột

# fat_label
source: Fat
vi: Chất béo

# gather_ingredients
source: Gather the ingredients.
vi: Chuẩn bị nguyên liệu.

# steam_dumplings
source: Steam the dumplings.
vi: Hấp há cảo.

# serve_with_sauce
source: Serve with dipping sauce.
vi: Phục vụ kèm nước chấm.

# pull_espresso
source: Pull a double shot of espresso.
vi: Rót một ly espresso đôi.

# foam_milk
source: Foam milk to twice its volume.
vi: Đánh sữa đến khi bọt tăng gấp đôi.

source: Serve immediately.
vi: Phục vụ ngay lập tức.

# boil_pasta
source: Boil the pasta until al dente.
vi: Luộc mì Ý đến khi chín mềm.

# prepare_sauce
source: Prepare the sauce.
vi: Chuẩn bị nước sốt.

source: Combine and serve.
vi: Trộn và phục vụ.

# preheat_oven
source: Preheat the oven.
vi: Làm nóng lò nướng.

# prepare_pizza_dough
source: Prepare the pizza dough.
vi: Chuẩn bị đế bánh pizza.

source: Add toppings and bake.
vi: Thêm nhân và nướng.

# prepare_rice
source: Prepare sushi rice.
vi: Chuẩn bị cơm sushi.

# roll_sushi
source: Roll the sushi.
vi: Cuộn sushi.

source: Slice and serve.
vi: Cắt và phục vụ.

# wash_vegetables
source: Wash the vegetables.
vi: Rửa rau.

# chop_ingredients
source: Chop the ingredients.
vi: Cắt nhỏ nguyên liệu.

source: Toss and serve.
vi: Trộn và phục vụ.

source: Lettuce
vi: Xà lách

source: Tomatoes
vi: Cà chua

source: Cucumber
vi: Dưa leo

source: Salad Dressing
vi: Nước sốt salad

source: Espresso Shots
vi: Cà phê espresso

source: Whole Milk
vi: Sữa tươi

source: Spaghetti
vi: Mì Ý

source: Tomato Sauce
vi: Nước sốt cà chua

source: Grated Cheese
vi: Phô mai bào

source: Minced Beef
vi: Thịt bò băm

source: Pizza Dough
vi: Đế bánh pizza

source: Mozzarella
vi: Phô mai mozzarella

source: Sushi Rice
vi: Cơm sushi

source: Nori Seaweed
vi: Rong biển nori

source: Raw Salmon
vi: Cá hồi sống

source: Avocado
vi: Bơ

source: Ground Pork
vi: Thịt heo xay

source: Cabbage
vi: Bắp cải

source: Soy Sauce
vi: Nước tương

source: Dumpling Wrappers
vi: Vỏ há cảo

source: Estimated Cost
vi: Chi phí dự kiến

# posted_at
source: Posted on
vi: Đăng vào

# home_label
source: Home
vi: Trang chủ

# favorites_label
source: Favorites
vi: Yêu thích

# no_favorites
source: No favorites yet.
vi: Chưa có mục yêu thích nào.

# login_title
source: Login
vi: Đăng nhập

# register_title
source: Register
vi: Đăng ký

# username_label
source: Username
vi: Tên đăng nhập

# password_label
source: Password
vi: Mật khẩu

# username_required
source: Username is required.
vi: Tên đăng nhập là bắt buộc.

# password_required
source: Password is required.
vi: Mật khẩu là bắt buộc.

# login_button
source: Login
vi: Đăng nhập

# register_button
source: Register
vi: Đăng ký

# switch_to_register
source: Don't have an account? Register
vi: Chưa có tài khoản? Đăng ký

# switch_to_login
source: Already have an account? Login
vi: Đã có tài khoản? Đăng nhập

# login_success
source: Login successful!
vi: Đăng nhập thành công!

# login_failed
source: Invalid username or password.
vi: Tên đăng nhập hoặc mật khẩu không đúng.

# register_success
source: Registration successful!
vi: Đăng ký thành công!

# register_failed
source: Username already exists.
vi: Tên đăng nhập đã tồn tại.

# rate_recipe_label
source: Rate this Recipe
vi: Đánh giá công thức này

# your_rating_label
source: Your Rating
vi: Đánh giá của bạn
